export default async function Refund() {
    const text = (
        <>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                1. ОБЩИЕ ПОЛОЖЕНИЯ
            </h2>
            <p style={{ fontSize: '20px' }}>
                1.1. Настоящие Правила и порядок возврата денежных средств
                (далее — «Правила») определяют условия, сроки и порядок возврата
                уплаченных Заказчиком денежных средств при отказе от получения
                информационно-консультационных услуг [Фамилия Имя Отчество]
                (далее — «Исполнитель»).{' '}
            </p>

            <p style={{ fontSize: '20px' }}>
                1.2. Настоящие Правила разработаны в соответствии с Гражданским
                кодексом РФ, Законом РФ от 07.02.1992 № 2300-1 «О защите прав
                потребителей» и Договором публичной оферты, размещенным на сайте
                [Адрес сайта].{' '}
            </p>

            <p style={{ fontSize: '20px' }}>
                1.3. Совершая оплату услуги на сайте Исполнителя, Заказчик
                подтверждает свое полное и безоговорочное согласие с настоящими
                Правилами.{' '}
            </p>

            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                2. УСЛОВИЯ ВОЗВРАТА И РАСЧЕТ СУММЫ К ВОЗВРАТУ
            </h2>
            <p style={{ fontSize: '20px' }}>
                2.1. Заказчик вправе отказаться от исполнения Договора и
                запросить возврат денежных средств в любой момент до начала
                оказания Услуги.{' '}
            </p>
            <p style={{ fontSize: '20px' }}>
                2.2. При отказе Заказчика от Услуги сумма возврата
                рассчитывается за вычетом фактически понесенных расходов (ФПР)
                Исполнителя, связанных с исполнением обязательств по
                Договору:{' '}
            </p>
            <ul>
                <li style={{ marginLeft: '30px' }}>
                    Отказ более чем за 24 часа до забронированного времени:
                    Исполнитель возвращает Заказчику 100% стоимости Услуги за
                    вычетом комиссий эквайринга/платежных систем и банковских
                    организаций за проведение платежа и обратного перевода
                    (признаваемых ФПР Исполнителя).
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Отказ менее чем за 24 часа до забронированного времени: Из
                    суммы возврата удерживаются комиссии платежных систем, а
                    также расходы Исполнителя на подготовку к консультации и
                    бронирование времени в графике в размере [указать %,
                    например: 50%] от стоимости Услуги.{' '}
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Отказ непосредственно во время или после проведения
                    консультации: Денежные средства возврату не подлежат, так
                    как Услуга признается оказанной в полном объеме (п. 1 ст.
                    779 ГК РФ).{' '}
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Неявка Заказчика на консультацию (опоздание более чем на 15
                    минут): Услуга считается оказанной в полном объеме в
                    соответствии с п. 6.3.3 Публичной оферты, денежные средства
                    возврату не подлежат.{' '}
                </li>
            </ul>
            <p style={{ fontSize: '20px' }}>
                2.3. В случае, если отмена консультации произошла по вине или
                инициативе Исполнителя, Заказчику возвращается 100% уплаченных
                денежных средств без удержания каких-либо комиссий и расходов,
                либо по согласованию Сторон консультация переносится на другое
                время.{' '}
            </p>

            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                3. ПОРЯДОК ПОДАЧИ ЗАЯВЛЕНИЯ НА ВОЗВРАТ
            </h2>
            <p style={{ fontSize: '20px' }}>
                3.1. Для осуществления возврата денежных средств Заказчик обязан
                направить письменное заявление (в свободной форме или по форме
                Исполнителя) на адрес электронной почты Исполнителя: [Ваш
                contact e-mail]. 3.2. В заявлении на возврат Заказчик
                указывает:{' '}
            </p>
            <ul>
                <li style={{ marginLeft: '30px' }}>
                    Фамилию, Имя, Отчество Заказчика;{' '}
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Контактный телефон и e-mail, указанные при
                    бронировании;{' '}
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Дату и время забронированной консультации;{' '}
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Причину отказа от Услуги;
                </li>
            </ul>
            <p style={{ fontSize: '20px' }}>
                Реквизиты банковского счета (карты), с которого была произведена
                оплата (номер счета, БИК банка, ФИО владельца счета).{' '}
            </p>

            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                4. СРОКИ И ПОРЯДОК ВОЗВРАТА
            </h2>
            <p style={{ fontSize: '20px' }}>
                4.1. Срок рассмотрения заявления и возврата денежных средств
                составляет до 10 (десяти) календарных дней с момента получения
                корректно заполненного заявления Исполнителем (ст. 22 Закона РФ
                «О защите прав потребителей»).{' '}
            </p>

            <p style={{ fontSize: '20px' }}>
                4.2. Возврат денежных средств осуществляется исключительно
                безналичным путем на те же банковские реквизиты (банковскую
                карту), с которых была произведена первоначальная оплата Услуги.
                Возврат на карты третьих лиц не допускается.{' '}
            </p>

            <p style={{ fontSize: '20px' }}>
                4.3. Сроки фактического зачисления денежных средств на счет
                Заказчика зависят от внутреннего регламента банка-эмитента и
                могут составлять от 1 до 30 рабочих дней. Исполнитель не несет
                ответственности за задержку зачисления средств по вине платежных
                систем или банковских организаций.{' '}
            </p>

            <p style={{ fontSize: '20px' }}>
                4.4. В случае невозможности возврата средств на исходные
                реквизиты (например, в связи с закрытием счета или блокировкой
                карты), Заказчик обязан своевременно уведомить об этом
                Исполнителя и предоставить официальные документы из банка, а
                также новые реквизиты, оформленные строго на имя Заказчика.{' '}
            </p>
        </>
    )

    return (
        <div
            style={{
                backgroundColor: 'white',
                margin: '23px',
                padding: '30px',
                borderRadius: '30px',
                flex: 1,
            }}
        >
            <h1>
                <b style={{ fontSize: '30px' }}>
                    ПРАВИЛА И ПОРЯДОК ВОЗВРАТА ДЕНЕЖНЫХ СРЕДСТВ
                </b>
            </h1>

            {text}
        </div>
    )
}
