export default async function Oferta() {
    const text = (
        <>
            <p style={{ fontSize: '20px' }}>
                Нажимая кнопку «Оплатить» (или «Забронировать») и проставляя
                отметку в соответствующем поле на сайте doctor-shev.ru, я (далее
                — «Заказчик»), действуя своей волей и в своем интересе, даю свое
                согласие Шитовой Екатерине Вадимовне (ИНН: 524610588725),
                применяющему(ей) специальный налоговый режим «Налог на
                профессиональный доход» (далее — «Оператор»), на обработку моих
                персональных данных на следующих условиях:
            </p>

            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                Перечень персональных данных, на обработку которых дается
                согласие
            </h2>
            <ul>
                <li style={{ marginLeft: '30px' }}>Фамилия, Имя, Отчество;</li>
                <li style={{ marginLeft: '30px' }}>
                    Номер контактного телефона;
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Адрес электронной почты (e-mail)
                </li>
            </ul>

            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                Цели обработки персональных данных
            </h2>
            <ul>
                <li style={{ marginLeft: '30px' }}>
                    Заключение и исполнение Договора публичной оферты на
                    оказание информационно-консультационных услуг;
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Бронирование даты и времени проведения консультации;
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Направление ссылок доступа к платформам связи и письменных
                    рекомендаций;
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Направление кассовых чеков в соответствии с ФЗ № 422-ФЗ;
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Связь по вопросам оказания услуг.
                </li>
            </ul>

            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                Перечень действий с персональными данными
            </h2>
            <p style={{ fontSize: '20px' }}>
                Сбор, запись, систематизация, накопление, хранение, уточнение
                (обновление, изменение), извлечение, использование, передача
                (предоставление подтверждения платежным сервисам и операторам
                связи исключительно для исполнения договора), обезличивание,
                блокирование, удаление, уничтожение персональных данных.
            </p>

            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                Оговорка об отсутствии сбора медицинских данных
            </h2>
            <p style={{ fontSize: '20px' }}>
                Я подтверждаю, что Оператор не запрашивает, не собирает и не
                хранит сведения о состоянии моего здоровья. Любая информация о
                моем здоровье, озвученная мной в ходе консультации, передается
                исключительно по моей инициативе для получения общей
                информационно-консультационной помощи.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                Срок действия согласия и порядок отзыва
            </h2>
            <p style={{ fontSize: '20px' }}>
                Настоящее согласие действует с момента его предоставления и до
                момента достижения целей обработки данных либо до момента его
                отзыва. Согласие может быть отозвано мной в любой момент путем
                направления письменного заявления на электронную почту
                Оператора: doc.shev@mail.ru
            </p>
        </>
    )
    const oferta = (
        <>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                1. ОБЩИЕ ПОЛОЖЕНИЯ
            </h2>
            <p style={{ fontSize: '20px' }}>
                1.1. Данный документ является официальным предложением
                (публичной офертой) Шитова Екатерина Вадимовна, применяющего
                специальный налоговый режим «Налог на профессиональный доход»
                (далее - «Исполнитель»), адресованным любому дееспособному
                физическому лицу (далее - «Заказчик»), заключить договор на
                оказание информационно-консультационных услуг на условиях,
                изложенных ниже (далее - «Договор»).
            </p>

            <p style={{ fontSize: '20px' }}>
                1.2. В соответствии с пунктом 2 статьи 437 Гражданского кодекса
                Российской Федерации (ГК РФ), в случае принятия изложенных ниже
                условий и оплаты услуг, лицо, производящее акцепт данной оферты,
                становится Заказчиком.
            </p>
            <p style={{ fontSize: '20px' }}>
                1.3. <b>Важная оговорка:</b> Услуги, оказываемые Исполнителем,
                носят исключительно информационно-консультационный характер в
                сфере нутрициологии, питания и здорового образа жизни. Услуги не
                являются медицинской деятельностью, не направлены на постановку
                диагноза, профилактику, лечение заболеваний или медицинскую
                реабилитацию. Исполнитель не осуществляет назначение медицинских
                препаратов и не заменяет консультации профильных врачей.
                Акцептуя настоящую Оферту, Заказчик подтверждает, что осознает
                этот факт и берет на себя полную ответственность за свое
                здоровье.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                2. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
            </h2>
            <p style={{ fontSize: '20px' }}>
                В целях настоящей Оферты нижеприведенные термины используются в
                следующем значении:
            </p>
            <p style={{ fontSize: '20px' }}>
                2.1. Сайт - информационный веб-ресурс, размещенный в сети
                Интернет по адресу: doctor-shev.ru, через который осуществляется
                ознакомление с услугами и бронирование времени консультации.
            </p>
            <p style={{ fontSize: '20px' }}>
                2.2. Услуга - разовая информационно-консультационная услуга
                Исполнителя, предоставляемая в дистанционном формате в
                согласованное сторонами время.
            </p>
            <p style={{ fontSize: '20px' }}>
                2.3. Заявка (Бронирование) - должным образом оформленный запрос
                Заказчика на получение Услуги, содержащий необходимые данные
                (ФИО, телефон, адрес электронной почты) и выбранное время
                проведения консультации.
            </p>
            <p style={{ fontSize: '20px' }}>
                2.4. Ссылка доступа - уникальная гиперссылка, направляемая
                Исполнителем на электронную почту Заказчика, предназначенная для
                подключения Заказчика к выбранной платформе связи (телефонный
                звонок, IP-телефония, собственный сервис Исполнителя, MTS Link,
                Zoom и др.) в забронированное время.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                3. ПРЕДМЕТ ДОГОВОРА
            </h2>
            <p style={{ fontSize: '20px' }}>
                3.1. Исполнитель обязуется оказать Заказчику Услугу в виде
                проведения разовой дистанционной устной консультации с
                последующим предоставлением информационных (письменного) резюме,
                а Заказчик обязуется оплатить эту Услугу в соответствии с
                условиями настоящей Оферты.
            </p>
            <p style={{ fontSize: '20px' }}>
                3.2. Продолжительность устной консультации составляет 30 – 60
                минут в зависимости от потребности клиента и достаточности
                информации. В случае отсутствия вопросов у клиента
                продолжительность консультации может быть уменьшена.
            </p>
            <p style={{ fontSize: '20px' }}>
                3.3. Формат и платформа для проведения консультации выбираются
                Заказчиком на этапе Бронирования из доступных вариантов (звонок,
                видеозвонок, Zoom, MTS Link и т.д.).
            </p>
            <p style={{ fontSize: '20px' }}>
                3.4. Исполнитель не требует от Заказчика предоставления
                медицинских документов (результатов анализов, выписок из историй
                болезни). Если Заказчик по собственной инициативе демонстрирует
                или упоминает такие данные в ходе консультации, Исполнитель
                рассматривает их исключительно как справочную информацию для
                формирования общих рекомендаций по образу жизни, не осуществляя
                их медицинскую расшифровку или систематизацию.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                4. ПОРЯДОК ЗАКЛЮЧЕНИЯ ДОГОВОРА (АКЦЕПТ ОФЕРТЫ)
            </h2>
            <p style={{ fontSize: '20px' }}>
                4.1. Акцептом (полным и безоговорочным согласием с условиями
                настоящей Оферты) признается осуществление Заказчиком 100%
                (стопроцентной) предварительной оплаты стоимости Услуги на Сайте
                Исполнителя (ст. 438 ГК РФ).
            </p>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                4.2. Алгоритм заключения Договора:
            </h3>
            <p style={{ fontSize: '20px' }}>
                4.2.1. Заказчик знакомится с условиями настоящей Оферты и
                Политикой обработки персональных данных на Сайте.
            </p>
            <p style={{ fontSize: '20px' }}>
                4.2.2. Заказчик заполняет форму Бронирования на Сайте, указывая
                достоверные данные: Фамилию, Имя, Отчество (при наличии),
                контактный номер телефона и адрес электронной почты (email), а
                также выбирает свободные дату и время консультации.
            </p>
            <p style={{ fontSize: '20px' }}>
                4.2.3. Проставление Заказчиком галочки (чек-бокса) в поля
                «Согласен(на) на обработку персональных данных», «Согласен(на)
                на получение информационных рассылок», «Нажимая кнопку
                подтвердить, вы подтверждаете согласие с условиями Публичной
                оферты» (или аналогичном) равносильно собственноручной подписи
                Заказчика.
            </p>
            <p style={{ fontSize: '20px' }}>
                4.2.4. Заказчик перенаправляется на страницу платежной системы
                (интернет-эквайринга) для внесения 100% предоплаты.
            </p>
            <p style={{ fontSize: '20px' }}>
                4.3. Договор между Заказчиком и Исполнителем считается
                заключенным в момент поступления денежных средств на расчетный
                счет Исполнителя.
            </p>
            <p style={{ fontSize: '20px' }}>
                4.4. После поступления оплаты Исполнитель направляет на
                указанный Заказчиком адрес электронной почты:
            </p>
            <ul>
                <li style={{ marginLeft: '30px' }}>
                    Подтверждение бронирования и Ссылку доступа для подключения
                    к консультации в назначенное время;
                </li>
                <li style={{ marginLeft: '30px' }}>
                    Электронный чек, сформированный в приложении «Мой налог» в
                    порядке, предусмотренном Федеральным законом от 27.11.2018 N
                    422-ФЗ.
                </li>
            </ul>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                5. ПРАВА И ОБЯЗАННОСТИ СТОРОН
            </h2>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                5.1. Исполнитель обязан:
            </h3>
            <p style={{ fontSize: '20px' }}>
                5.1.1. Оказать Услуги надлежащего качества в объеме и в сроки,
                предусмотренные настоящей Офертой.
            </p>
            <p style={{ fontSize: '20px' }}>
                5.1.2. Заблаговременно направить Заказчику Ссылку доступа для
                подключения к консультации на указанный при бронировании адрес
                электронной почты (email).
            </p>
            <p style={{ fontSize: '20px' }}>
                5.1.3. Направить Заказчику письменные информационные резюме
                консультации течение 3 (трех) рабочих дней после проведения
                устной консультации.
            </p>
            <p style={{ fontSize: '20px' }}>
                5.1.4. Сохранять конфиденциальность информации, полученной от
                Заказчика в ходе оказания Услуг.
            </p>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                5.2. Исполнитель вправе:
            </h3>
            <p style={{ fontSize: '20px' }}>
                5.2.1. Отказать в оказании Услуги и прервать консультацию без
                возврата денежных средств в случае проявления Заказчиком
                агрессии, использования ненормативной лексики, неуважительного
                поведения, а также при нахождении Заказчика в состоянии
                очевидного алкогольного, наркотического или иного опьянения.
            </p>
            <p style={{ fontSize: '20px' }}>
                5.2.2. Самостоятельно определять формы, методы и способы
                оказания информационно-консультационных услуг.
            </p>
            <p style={{ fontSize: '20px' }}>
                5.2.3. В одностороннем порядке перенести время оказания Услуги в
                случае возникновения непредвиденных технических неполадок на
                стороне Исполнителя или форс-мажорных обстоятельств,
                заблаговременно уведомив об этом Заказчика.
            </p>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                5.3. Заказчик обязан:
            </h3>
            <p style={{ fontSize: '20px' }}>
                5.3.1. Указать достоверные контактные данные при Бронировании.
                Риск неполучения Ссылки доступа из-за некорректно указанного
                email или попадания письма в папку «Спам» (которую Заказчик не
                проверил) полностью лежит на Заказчике.
            </p>
            <p style={{ fontSize: '20px' }}>
                5.3.2. Самостоятельно и за свой счет обеспечить техническую
                возможность получения Услуги (стабильное интернет-соединение,
                исправность микрофона и камеры, наличие установленного
                приложения Zoom/MTS Link и т.п., если выбран соответствующий
                формат).
            </p>
            <p style={{ fontSize: '20px' }}>
                5.3.3. Подключиться к консультации (перейти по Ссылке доступа
                или ответить на звонок) строго в забронированное время.
            </p>
            <p style={{ fontSize: '20px' }}>
                5.3.4. Внимательно ознакомиться с рекомендациями Исполнителя.
                При наличии сомнений относительно применения рекомендаций (с
                учетом индивидуальных особенностей организма, аллергий и т.д.)
                Заказчик обязан предварительно проконсультироваться с лечащим
                врачом.
            </p>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                5.4. Заказчик вправе:
            </h3>
            <p style={{ fontSize: '20px' }}>
                5.4.1. Получать разъяснения по вопросам, входящим в предмет
                консультации.
            </p>
            <p style={{ fontSize: '20px' }}>
                5.4.2. Использовать полученные материалы и резюме консультации
                исключительно для личных нужд.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                6. ПОРЯДОК ОКАЗАНИЯ И СДАЧИ-ПРИЕМКИ УСЛУГ
            </h2>
            <p style={{ fontSize: '20px' }}>
                6.1. Услуга оказывается дистанционно в дату и время,
                согласованные Сторонами при Бронировании.
            </p>
            <p style={{ fontSize: '20px' }}>
                6.2. Исполнитель признается выполнившим свои обязательства по
                обеспечению готовности к оказанию Услуги в момент направления
                Заказчику Ссылки доступа на электронную почту.
            </p>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                6.3. Правила опоздания и неявки:
            </h3>
            <p style={{ fontSize: '20px' }}>
                6.3.1. Допустимое время ожидания Заказчика Исполнителем в
                выбранной платформе связи составляет 15 (пятнадцать) минут от
                начала забронированного времени.
            </p>
            <p style={{ fontSize: '20px' }}>
                6.3.2. Если Заказчик подключается к консультации с опозданием (в
                пределах 15 минут), время проведения консультации не
                продлевается и завершается в изначально запланированное время.
            </p>
            <p style={{ fontSize: '20px' }}>
                6.3.3. Если Заказчик не подключился по Ссылке доступа (или не
                ответил на звонок) по истечении 15 минут от начала
                согласованного времени, это признается неявкой. В данном случае
                обязанность Исполнителя по оказанию Услуги считается исполненной
                надлежащим образом. Услуга считается оказанной, а уплаченные
                денежные средства не подлежат возврату, так как они признаются
                компенсацией фактически понесенных расходов Исполнителя на
                бронирование рабочего времени и подготовку к консультации.
            </p>
            <p style={{ fontSize: '20px' }}>
                6.4. В случае если проведение консультации невозможно по вине
                Исполнителя (болезнь, технические сбои и т.д.), Исполнитель
                предлагает Заказчику иное время проведения консультации либо
                осуществляет полный возврат денежных средств по выбору
                Заказчика.
            </p>
            <p style={{ fontSize: '20px' }}>
                6.5. Технические сбои на стороне Заказчика (отсутствие
                интернета, неисправность оборудования), возникшие
                непосредственно во время консультации, не являются основанием
                для признания Услуги не оказанной или оказанной ненадлежащим
                образом.6.6. Порядок приемки Услуг (Без бумажного Акта):
            </p>
            <p style={{ fontSize: '20px' }}>
                6.6.1. Услуга считается оказанной Исполнителем надлежащим
                образом и принятой Заказчиком в полном объеме, если в течение 1
                (одного) календарного дня с момента направления Исполнителем
                письменного резюме на email Заказчика, от Заказчика не поступили
                мотивированные письменные возражения.
            </p>
            <p style={{ fontSize: '20px' }}>
                6.6.2. Мотивированные возражения должны быть направлены на
                электронную почту Исполнителя [укажите ваш контактный email с
                подробным указанием несоответствия оказанной Услуги условиям
                Оферты.
            </p>
            <p style={{ fontSize: '20px' }}>
                6.6.3. Стороны пришли к безоговорочному соглашению, что
                составление и подписание двустороннего Акта об оказании услуг на
                бумажном носителе не требуется. Отсутствие письменных
                мотивированных возражений в срок, указанный в п. 6.6.1, имеет
                юридическую силу Акта об оказании услуг
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                7. ПОРЯДОК ПЕРЕНОСА КОНСУЛЬТАЦИИ И ВОЗВРАТА ДЕНЕЖНЫХ СРЕДСТВ
            </h2>
            <p style={{ fontSize: '20px' }}>
                7.1. Заказчик имеет право в одностороннем порядке отказаться от
                исполнения Договора до момента оказания Услуги при условии
                оплаты Исполнителю фактически понесенных им расходов (ст. 782 ГК
                РФ, ст. 32 Закона РФ «О защите прав потребителей»).
            </p>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                7.2. Правила переноса времени консультации:
            </h3>
            <p style={{ fontSize: '20px' }}>
                7.2.1. Заказчик вправе перенести дату и время консультации без
                финансовых потерь, направив уведомление Исполнителю не позднее
                чем за 24 (двадцать четыре) часа до согласованного времени
                проведения консультации.
            </p>
            <p style={{ fontSize: '20px' }}>
                7.2.2. В случае направления запроса о переносе менее чем за 24
                часа до консультации, перенос возможен только по согласованию с
                Исполнителем. При отсутствии у Исполнителя возможности
                предложить другое время и отказе Заказчика от консультации
                применяются правила возврата, указанные в п. 7.3.
            </p>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                7.3. Правила возврата денежных средств:
            </h3>
            <p style={{ fontSize: '20px' }}>
                7.3.1. При отказе Заказчика от Услуги более чем за 24 часа до
                забронированного времени, Исполнитель возвращает Заказчику
                уплаченные денежные средства за вычетом комиссий платежных
                систем (интернет-эквайринга) и банков за перевод денежных
                средств (признаваемых фактически понесенными расходами
                Исполнителя).
            </p>
            <p style={{ fontSize: '20px' }}>
                7.3.2. При отказе Заказчика от Услуги менее чем за 24 часа до
                забронированного времени, из суммы возврата удерживаются
                фактически понесенные расходы Исполнителя на подготовку к
                консультации и бронирование рабочего времени в размере 10% от
                стоимости консультации.
            </p>
            <p style={{ fontSize: '20px' }}>
                7.3.3. После проведения устной консультации (в том числе при
                отсутствии возражений в срок, указанный в п. 6.6.1) или при
                неявке Заказчика (п. 6.3.3), денежные средства возврату не
                подлежат, так как Услуга признается оказанной в полном объеме.
            </p>
            <p style={{ fontSize: '20px' }}>
                7.4. Возврат денежных средств осуществляется на основании
                письменного заявления Заказчика, направленного на электронную
                почту Исполнителя doc.shev@mail.ru , в течение 10 (десяти)
                календарных дней с момента получения заявления.
            </p>
            <p style={{ fontSize: '20px' }}>
                7.5. Возврат денежных средств производится исключительно на тот
                же банковский счет (карту), с которого была произведена оплата.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                8. ОТВЕТСТВЕННОСТЬ СТОРОН И ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ
            </h2>
            <p style={{ fontSize: '20px' }}>
                8.1. За неисполнение или ненадлежащее исполнение обязательств по
                настоящему Договору Стороны несут ответственность в соответствии
                с законодательством Российской Федерации.
            </p>
            <h3
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                8.2. Отказ от медицинских гарантий:
            </h3>
            <p style={{ fontSize: '20px' }}>
                8.2.1. Исполнитель не гарантирует конкретных медицинских или
                физиологических результатов от применения Заказчиком полученных
                рекомендаций, так как результат зависит от индивидуальных
                особенностей организма Заказчика, его дисциплины и точности
                выполнения рекомендаций.
            </p>
            <p style={{ fontSize: '20px' }}>
                8.2.2. Исполнитель не несет ответственности за вред, причиненный
                жизни и здоровью Заказчика, если Заказчик применил полученные
                знания в ходе диалога без предварительной консультации с лечащим
                врачом или при наличии индивидуальных противопоказаний, о
                которых Заказчик не уведомил Исполнителя.
            </p>
            <p style={{ fontSize: '20px' }}>
                8.2.3. Исполнитель не несет ответственности за диагнозы,
                медицинские заключения или лечение, ранее назначенные Заказчику
                сторонними медицинскими специалистами.
            </p>
            <p style={{ fontSize: '20px' }}>
                8.3. Интеллектуальная собственность: Все письменные
                информационные рекомендации, методические материалы и
                аудио/видеозаписи, предоставленные Исполнителем, являются
                объектом интеллектуальной собственности Исполнителя. Заказчику
                запрещается распространять (публиковать в сети Интернет,
                передавать третьим лицам) данные материалы без предварительного
                письменного согласия Исполнителя.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                9. ПЕРСОНАЛЬНЫЕ ДАННЫЕ И КОНФИДЕНЦИАЛЬНОСТЬ
            </h2>
            <p style={{ fontSize: '20px' }}>
                9.1. Обработка персональных данных Заказчика осуществляется
                Исполнителем в соответствии с Федеральным законом от 27.07.2006
                № 152-ФЗ «О персональных данных» и Политикой обработки
                персональных данных, размещенной на Сайте.
            </p>
            <p style={{ fontSize: '20px' }}>
                9.2. Принимая условия настоящей Оферты, Заказчик дает свое
                согласие на сбор, систематизацию, накопление, хранение и
                использование своих персональных данных (ФИО, телефон, email)
                для целей исполнения настоящего Договора.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                10. РАЗРЕШЕНИЕ СПОРОВ И ФОРС-МАЖОР
            </h2>
            <p style={{ fontSize: '20px' }}>
                10.1. Стороны освобождаются от ответственности за частичное или
                полное неисполнение обязательств по Договору, если оно явилось
                следствием обстоятельств непреодолимой силы (форс-мажор):
                стихийные бедствия, военные действия, сбои в работе
                магистральных каналов сети Интернет, глобальные блокировки
                сервисов связи и т.д.
            </p>
            <p style={{ fontSize: '20px' }}>
                10.2. Все споры и разногласия Стороны решают путем переговоров.
                Претензионный порядок решения споров является обязательным. Срок
                рассмотрения письменной претензии составляет 10 (десять)
                календарных дней с момента ее получения на email Стороны.
            </p>
            <p style={{ fontSize: '20px' }}>
                10.3. В случае невозможности разрешения спора путем переговоров,
                он подлежит рассмотрению в суде по месту нахождения Исполнителя
                в соответствии с законодательством РФ.
            </p>
            <h2
                style={{
                    fontSize: '20px',
                    textAlign: 'center',
                    fontWeight: 700,
                    marginTop: '25px',
                }}
            >
                11. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ
            </h2>
            <p style={{ fontSize: '20px' }}>
                Исполнитель: Физическое лицо, применяющее специальный налоговый
                режим «Налог на профессиональный доход»
            </p>
            <p style={{ fontSize: '20px' }}>Шитова Екатерина Вадимовна </p>
            <p style={{ fontSize: '20px' }}>ИНН: 524610588725</p>
            <p style={{ fontSize: '20px' }}>E-mail: doc.shev@mail.ru </p>
            <p style={{ fontSize: '20px' }}>
                Банковские реквизиты для возвратов/расчетов:
            </p>
            <p style={{ fontSize: '20px' }}>Расчетный счет: [№ счета] </p>
            <p style={{ fontSize: '20px' }}>Банк: [Название банка] </p>
            <p style={{ fontSize: '20px' }}>БИК: [БИК банка] </p>
            <p style={{ fontSize: '20px' }}>Корр. счет: [№ корр. счета] </p>
        </>
    )

    return (
        <div
            style={{
                backgroundColor: 'white',
                margin: '23px',
                padding: '30px',
                borderRadius: '30px',
                flex: 1,
            }}
        >
            <h1>
                <b style={{ fontSize: '30px' }}>
                    ПУБЛИЧНАЯ ОФЕРТА НА ОКАЗАНИЕ ИНФОРМАЦИОННО -
                    КОНСУЛЬТАЦИОННЫХ УСЛУГ
                </b>
            </h1>

            {oferta}
        </div>
    )
}
